app/controllers/api/v1/companies_controller.rb

  def index
    respond_with Company.all
---
SELECT "companies".* FROM "companies"

  def create
    respond_with :api, :v1, Company.create(company_params)
---
INSERT INTO "companies" ("name", "earnings", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "comiu"], ["earnings", 1], ["created_at", 2016-10-01 01:19:25 UTC], ["updated_at", 2016-10-01 01:19:25 UTC]]

  def destroy
    respond_with Company.destroy(params[:id])
---
DELETE FROM "companies" WHERE "companies"."id" = ?  [["id", 18]]